function fractal_growth
%¹æÔò£º
%Ã¿žö0Ïž°ûÒÔ1-£š1-p)^nµÄžÅÂÊ±ä³É2Ïž°û£¬ÆäÖÐpÊÇÒ»žø¶šÊý(ÕâÀïµÈÓÚ0.245)£¬nÎªÖÜÎ§2Ïž°ûžöÊý¡£·ñÔò0Ïž°û±£³Ö0Ïž°û
%£š²Î¿ŒÎïÀíÖÐµÄŒüÓâÉøÄ£ÐÍ£©
%2Ïž°ûÎÞÌõŒþ±ä³É1Ïž°û
%1Ïž°ûÎÞÌõŒþ±£³Ö1Ïž°û
a=zeros(200,200);
a(98:102,98:102)=2;%ÕâÀï2Ïž°û³äµ±ÖÖ×ÓµÄœÇÉ«
k=[1 1 1
   1 0 1
   1 1 1];
p=1-(1-0.245).^(0:8);%Ô€ÏÈËãºÃ1-£š1-p)^n
tic
while(1)
    a1=conv2(double(a==2),k,'same');
    a=double(a>=1)+... %ÕâÒ»Ïî±£Ö€(1,2)->1
      and(rand(200)<p(a1+1),a==0)*2; %ÕâÒ»ÏîÓÃÓÚ0->2
    if toc>0.1
       tic
       image(a*24);axis equal
       drawnow
    end
end
